shadow578/hc32f460-documentation-and-sdk/sdk/Minimum development project template/hc32f460_template_v1.0.2/hc32f460keta_template/example/EWARM/startup_hc32f460keta.s
                PUBWEAK IRQ122_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ122_Handler
                B       IRQ122_Handler

                PUBWEAK IRQ123_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ123_Handler
                B       IRQ123_Handler

                PUBWEAK IRQ124_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ124_Handler
                B       IRQ124_Handler

                PUBWEAK IRQ125_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ125_Handler
                B       IRQ125_Handler

                PUBWEAK IRQ126_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ126_Handler
                B       IRQ126_Handler

                PUBWEAK IRQ127_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ127_Handler
                B       IRQ127_Handler

                PUBWEAK IRQ128_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ128_Handler
                B       IRQ128_Handler

                PUBWEAK IRQ129_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ129_Handler
                B       IRQ129_Handler

                PUBWEAK IRQ130_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ130_Handler
                B       IRQ130_Handler

                PUBWEAK IRQ131_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ131_Handler
                B       IRQ131_Handler

                PUBWEAK IRQ132_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ132_Handler
                B       IRQ132_Handler

                PUBWEAK IRQ133_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ133_Handler
                B       IRQ133_Handler

                PUBWEAK IRQ134_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ134_Handler
                B       IRQ134_Handler

                PUBWEAK IRQ135_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ135_Handler
                B       IRQ135_Handler

                PUBWEAK IRQ136_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ136_Handler
                B       IRQ136_Handler

                PUBWEAK IRQ137_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ137_Handler
                B       IRQ137_Handler

                PUBWEAK IRQ138_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ138_Handler
                B       IRQ138_Handler

                PUBWEAK IRQ139_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ139_Handler
                B       IRQ139_Handler

                PUBWEAK IRQ140_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ140_Handler
                B       IRQ140_Handler

                PUBWEAK IRQ141_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ141_Handler
                B       IRQ141_Handler

                PUBWEAK IRQ142_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ142_Handler
                B       IRQ142_Handler

                PUBWEAK IRQ143_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ143_Handler
                B       IRQ143_Handler

                END
